Tekla Open API Reference for Tekla Structures 2025
PrinterItem Class
 The PrinterItem class contains information about the printers in the Tekla Structures catalog.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Catalogs.PrinterItem
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class PrinterItem
<SerializableAttribute>
Public Class PrinterItem
The PrinterItem type exposes the following members.
Constructors
Name | Description
PrinterItem
 Creates a new printer item instance.
Top
Properties
Name | Description
Device
 The actual printer device used in the printing.
Extension
 The printer item's default file extension which is used when printing to a file.
Name
 The printer item's name which Tekla Structures uses to fetch all the item's default properties in the printing process.
PrintAreaHeigth
 The printer item's print area height.
PrintAreaWidth
 The printer item's print area width.
Top
See Also
Reference
Tekla.Structures.Catalogs Namespace